In [2]:
import numpy as np
import pandas as pd

In [23]:
d = {'A':[9,8,np.nan], 'B':[4,np.nan,np.nan], 'C':[1,2,3], }

In [31]:
df = pd.DataFrame(d, index = ['X','Y','Z'])

In [32]:
df

     A    B  C
X  9.0  4.0  1
Y  8.0  NaN  2
Z  NaN  NaN  3

In [33]:
df.dropna()

     A    B  C
X  9.0  4.0  1

In [34]:
df.dropna(axis = 1)

   C
X  1
Y  2
Z  3

In [35]:
df

     A    B  C
X  9.0  4.0  1
Y  8.0  NaN  2
Z  NaN  NaN  3

In [36]:
df.dropna(thresh=2)

     A    B  C
X  9.0  4.0  1
Y  8.0  NaN  2

In [37]:
df

     A    B  C
X  9.0  4.0  1
Y  8.0  NaN  2
Z  NaN  NaN  3

In [38]:
df.fillna('Manthan')

         A        B  C
X        9        4  1
Y        8  Manthan  2
Z  Manthan  Manthan  3

In [39]:
df

     A    B  C
X  9.0  4.0  1
Y  8.0  NaN  2
Z  NaN  NaN  3

In [41]:
df['A'].fillna(value = df['A'].mean())

X    9.0
Y    8.0
Z    8.5
Name: A, dtype: float64